Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: When you have multiple connectors, you would need to indicate which connector you want to use in the application configuration.
ja_jp: 複数のコネクターがある場合は、アプリケーション設定で使用するコネクターを指定する必要があります。

source: When you have multiple server interceptors, you can order them by implementing the `jakarta.enterprise.inject.spi.Prioritized` interface. Please note that all the global interceptors are invoked before the service-specific interceptors.
ja_jp: 複数のサーバーインターセプターがある場合、 `jakarta.enterprise.inject.spi.Prioritized` インターフェースを実装することで、それらを順番に並べることができます。すべてのグローバルインターセプターは、サービス固有のインターセプターの前に起動されることに注意してください。

source: When you have multiple server interceptors, you can order them by implementing the `javax.enterprise.inject.spi.Prioritized` interface. Please note that all the global interceptors are invoked before the service-specific interceptors.
ja_jp: 複数のサーバーインターセプターがある場合、 `javax.enterprise.inject.spi.Prioritized` インターフェースを実装することで、それらを順番に並べることができます。すべてのグローバルインターセプターは、サービス固有のインターセプターの前に起動されることに注意してください。

source: When you have your Quarkus project configured, you can add the Drools Quarkus extensions to your project by adding the following dependencies to your `pom.xml`:
ja_jp: Quarkus プロジェクトを設定したら、次の依存関係を `pom.xml` に追加することで、Drools Quarkus エクステンションをプロジェクトに追加できます。

source: When you import custom Keycloak realms, you may find, after inspecting both the access and ID tokens in Dev UI, that only the access token contains the list of roles in its `groups` claim. This information is important for accessing endpoints that are secured with the `@RolesAllowed` annotation. To tell Keycloak to include this information in the ID token, add the `microprofile-jwt` scope to the list of client scopes in the Keycloak admin console. Alternatively, add the `microprofile-jwt` scope to the list of required scopes using the `quarkus.oidc.authentication.scopes` property.
ja_jp: カスタム Keycloak レルムをインポートする場合、Dev UI でアクセストークンと ID トークンの両方を検査した後、アクセストークンのみに `groups` クレームのロールのリストが含まれていることがわかります。 この情報は、`@RolesAllowed` アノテーションで保護されたエンドポイントにアクセスする際に重要です。 Keycloak にこの情報を ID トークンに含めるように指示するには、Keycloak 管理コンソールのクライアントスコープのリストに `microprofile-jwt` スコープを追加します。 または、`quarkus.oidc.authentication.scopes` プロパティーを使用して、必要なスコープのリストに `microprofile-jwt` スコープを追加します。

source: When you invoke an HTTP request on the API Gateway, the Gateway turns that HTTP request into a JSON event document that is forwarded to a Quarkus Lambda. The Quarkus Lambda parses this json and converts in into an internal representation of an HTTP request that can be consumed by any HTTP framework Quarkus supports (JAX-RS, servlet, Reactive Routes).
ja_jp: API Gateway で HTTP リクエストを呼び出すと、ゲートウェイはその HTTP リクエストを JSON イベントドキュメントに変換し、Quarkus Lambda に転送します。Quarkus Lambda はこの json を解析し、Quarkus がサポートする任意の HTTP フレームワーク (JAX-RS、サーブレット、Reactive Routes) で使用できる HTTP リクエストの内部表現に変換します。

source: When you invoke an HTTP request on the API Gateway, the Gateway turns that HTTP request into a JSON event document that is forwarded to a Quarkus Lambda. The Quarkus Lambda parses this json and converts in into an internal representation of an HTTP request that can be consumed by any HTTP framework Quarkus supports (Jakarta REST, servlet, Reactive Routes).
ja_jp: API GatewayでHTTPリクエストを呼び出すと、GatewayはそのHTTPリクエストをJSONイベントドキュメントに変換し、Quarkus Lambdaに転送されます。Quarkus LambdaはこのJSONを解析し、QuarkusがサポートするあらゆるHTTPフレームワーク（Jakarta REST、サーブレット、Reactive Routes）で使用できるHTTPリクエストの内部表現に変換します。

source: When you need an action to be completed before the current request is allowed to proceed, especially when an action requires a blocking call, register one or more `io.quarkus.oidc.AuthenticationCompletionAction` interface implementations.
ja_jp: 現在のリクエストが処理を続行する前にアクションを完了する必要がある場合、特にアクションがブロッキング呼び出しを必要とする場合は、1 つ以上の `io.quarkus.oidc.AuthenticationCompletionAction` インターフェースの実装を登録します。

source: When you need to create a hashed password we provide the convenient `String BcryptUtil.bcryptHash(String password)` function, which defaults to creating a random salt and hashing in 10 iterations. You can also specify the number of iterations and the salt.
ja_jp: このようなハッシュ化されたパスワードを作成する必要がある場合は、便利な `String BcryptUtil.bcryptHash(String password)` 関数を用意しています。デフォルトでは、ランダムなソルトを作成して 10 回の繰り返しでハッシュ化します (繰り返しとソルトを指定することもできます)。

source: When you need to create such a hashed password we provide the convenient `String BcryptUtil.bcryptHash(String password)` function, which defaults to creating a random salt and hashing in 10 iterations (though you can specify the iterations and salt too).
ja_jp: このようなハッシュ化されたパスワードを作成する必要がある場合は、便利な `String BcryptUtil.bcryptHash(String password)` 関数を用意しています。デフォルトでは、ランダムなソルトを作成して 10 回の繰り返しでハッシュ化します (繰り返しとソルトも指定できます)。

source: When you need to customize the serialization and deserialization, you can provide a custom codec.
ja_jp: シリアライゼーションとデシリアライゼーションをカスタマイズする必要がある場合は、カスタムコーデックを提供できます。

source: When you need to inject `SecurityIdentity` in a Vert.x route handler registered directly on the xref:reactive-routes.adoc#using-vertx-web-router[Vert.x Web Router], then requesting the `SecurityIdentity` propagation is required. For example:
ja_jp: xref:reactive-routes.adoc#using-vertx-web-router[Vert.x Web Router] に直接登録された Vert.x ルートハンドラーに `SecurityIdentity` をインジェクトする必要がある場合、 `SecurityIdentity` の伝播を要求する必要があります。例:

source: When you need to propagate the current Authorization Code Flow access token then the immediate token propagation will work well - as the code flow access tokens (as opposed to ID tokens) are meant to be propagated for the current Quarkus endpoint to access the remote services on behalf of the currently authenticated user.
ja_jp: 現在の認可コードフローアクセストークンを伝播する必要がある場合は、即時トークン伝播はうまく機能します - コードフローアクセストークン (ID トークンとは対照的に) は、現在認証されているユーザーに代わってリモートサービスにアクセスするように、現在の Quarkus エンドポイントに伝搬されることが意図されています。

source: When you need to propagate the current Authorization Code Flow access token, immediate token propagation works well because the code flow access tokens, as opposed to ID tokens, are meant to be propagated for the current Quarkus endpoint to access the remote services on behalf of the currently authenticated user.
ja_jp: 現在の認可コードフローアクセストークンを伝播する必要がある場合、コードフローアクセストークンは (ID トークンとは異なり) 現在認証されているユーザーに代わってリモートサービスにアクセスするために現在の Quarkus エンドポイントに伝播されることを意図しているため、即時トークン伝播がうまく機能します。

source: When you need to propagate the current Authorization Code Flow access token, then the immediate token propagation will work well - as the code flow access tokens (as opposed to ID tokens) are meant to be propagated for the current Quarkus endpoint to access the remote services on behalf of the currently authenticated user.
ja_jp: 現在の認可コードフローアクセストークンを伝播する必要がある場合、即時トークン伝播が適切に機能します。これは、 (ID トークンではなく) コードフローアクセストークンが、現在認証されているユーザーに代わってリモートサービスにアクセスするために現在の Quarkus エンドポイントに伝播されるように想定されているためです。

source: When you now execute an HTTP GET request against `http://localhost:8080/hello`, you should see a JSON message with the value `hi` as its `message` field.
ja_jp: `http://localhost:8080/hello` に対してHTTP GETリクエストを実行すると、 `message` フィールドに `hi` という値を持つJSONメッセージが表示されるはずです。

source: When you open the flamegraph, you will see all threads' work collapsed into a single area. Then, you can clearly see that there's some locking that could affect performance.
ja_jp: フレームグラフを開くと、すべてのスレッドの作業が1つの領域に折りたたまれているのがわかります。そして、パフォーマンスに影響を与える可能性のあるロックがあることがはっきりとわかります。

source: When you provide the credentials of an authorized user, for example, `admin:admin`, the JPA security extension authenticates and loads the roles of the user. The `admin` user is authorized to access the protected resources.
ja_jp: 許可されたユーザーの資格情報、例えば `admin:admin` を提供すると、JPA セキュリティエクステンションはそのユーザーのロールを認証してロードします。 `admin` ユーザーは保護されたリソースへのアクセスを許可されます。

source: When you provide the credentials of an authorized user, for example, `admin:admin`, the Jakarta Persistence security extension authenticates and loads the roles of the user. The `admin` user is authorized to access the protected resources.
ja_jp: 認可されたユーザーのクレデンシャル（例えば、 `admin:admin` ）を提供すると、Jakarta Persistenceセキュリティエクステンションは、認証してそのユーザーのロールをロードします。 `admin` ユーザーは、保護されたリソースへのアクセスが認可されます。

source: When you provide the credentials of an authorized user, for example, `admin:admin`, the Jakarta Persistence security extension authenticates and loads the user's roles. The `admin` user is authorized to access the protected resources.
ja_jp: 認可されたユーザーの認証情報 (例: `admin:admin`) を提供すると、Jakarta Persistence セキュリティーエクステンションは認証してそのユーザーのロールをロードします。 `admin` ユーザーは、保護されたリソースへのアクセスが認可されます。

source: When you provide user credentials, Quarkus configures the database to use them. This helps when you connect to the database with an external tool.
ja_jp: ユーザーのクレデンシャルを提供すると、Quarkus はそれらを使用するようにデータベースを設定します。 これは、外部ツールを使用してデータベースに接続する場合に役立ちます。

source: When you register clients in startup, as described in the <<register-clients-on-startup>> section, you will most likely want to avoid creating duplicate registrations after a restart.
ja_jp: <<register-clients-on-startup>> セクションの説明に従って起動時にクライアントを登録する場合は、おそらく再起動後に重複した登録を作成しないようにする必要があるでしょう。

source: When you run a Quarkus application in dev mode, you can expose a Model Context Protocol (MCP) server. It presents the methods used by the DevUI *MCP tools* (methods you can call) and the data exposed by *MCP resources*.
ja_jp: Quarkus アプリケーションを dev モードで実行すると、Model Context Protocol (MCP) サーバーを公開できます。これは、Dev UI の *MCP ツール* (呼び出し可能なメソッド) で使用されるメソッドと、 *MCP リソース* によって公開されるデータを提示します。

source: When you run an application created in either the <<vertx-oidc-vertx>> or <<vertx-oidc-quarkus>> sections, you can use your browser's developer tools to observe that an opaque `vertx-web-session` session cookie is used to track the user session:
ja_jp: <<vertx-oidc-vertx>> または <<vertx-oidc-quarkus>> セクションで作成したアプリケーションを実行すると、ブラウザーの開発者ツールを使用して、不透明な `vertx-web-session` セッションクッキーがユーザーセッションの追跡に使用されていることを観察できます。

source: When you run either command, the following XML is added to your build file:
ja_jp: どちらかのコマンドを実行すると、ビルドファイルに以下のようなXMLが追加されます。:

source: When you run the application in dev mode or execute tests, Compose Dev Services will automatically start the PostgreSQL service defined in the `compose-devservices.yml` file, instead of using the default dev service provided by the `quarkus-jdbc-postgresql` extension.
ja_jp: 開発モードでアプリケーションを実行したりテストを実行したりすると、Compose Dev Services は、`quarkus-jdbc-postgresql` エクステンションによって提供されるデフォルトの dev service を使用する代わりに、`compose-devservices.yml` ファイルで定義された PostgreSQL サービスを自動的に起動します。

source: When you run your test (remember to use Java 21+), Quarkus detects pinned carrier threads. When it happens, the test fails.
ja_jp: テストを実行する場合は (Java 21+ を使用することを忘れないでください)、Quarkus はピン留めされたキャリアースレッドを検出します。 この場合、テストは失敗します。

source: When you send messages or requests with clients that don't propagate the OpenTelemetry context you will have incomplete traces or broken traces, when the destination creates spans but because no context was propagated, the parent span is non-existent. This will cause more than one trace per request, which will cause problems.
ja_jp: OpenTelemetry コンテキストを伝播しないクライアントでメッセージまたはリクエストを送信すると、宛先がスパンを作成しても、コンテキストが伝播されなかったため、親スパンが存在しない場合に不完全なトレースまたは壊れたトレースが発生します。これにより、リクエストごとに複数のトレースが発生し、問題を引き起こします。

source: When you set multiple tenant configurations in the `application.properties` file, you only need to specify how the tenant identifier gets resolved. To configure the resolution of the tenant identifier, use one of the following options:
ja_jp: `application.properties` ファイルで複数のテナント設定を行う場合は、テナント識別子の解決方法を指定するだけで済みます。 テナント識別子の解決を設定するには、次のいずれかのオプションを使用します。

source: When you set the log level to below `DEBUG`, for example `TRACE`, you must also adjust the minimum log level.
ja_jp: ログレベルを `DEBUG` 未満 (例えば `TRACE`) に設定する場合は、最小ログレベルも調整する必要があります。

source: When you set the log level to below `DEBUG`, you must also adjust the minimum log level. This setting is either global, using the `quarkus.log.min-level` configuration property, or per category:
ja_jp: ログ・レベルを `DEBUG` 以下に設定する場合、最小ログ・レベルも調整する必要があります。 この設定は、 `quarkus.log.min-level` 設定プロパティを使用してグローバルに行うか、カテゴリごとに行います：

source: When you set the log level to below `DEBUG`, you must also adjust the minimum log level. This setting might be applied either globally with the `quarkus.log.min-level` configuration property, or per category:
ja_jp: ログレベルを `DEBUG` 未満に設定する場合は、最小ログレベルも調整する必要があります。 この設定は、 `quarkus.log.min-level` 設定プロパティーを使用してグローバルに適用することも、カテゴリーごとに適用することもできます。

source: When you start your application in dev mode, Dev Services for PostgreSQL launches a PostgreSQL dev mode container so that you can start developing your application. While developing your application, you can add and run tests individually by using the xref:continuous-testing.adoc[Continuous Testing] feature. Dev Services for PostgreSQL supports testing while you develop by providing a separate PostgreSQL test container that does not conflict with the dev mode container.
ja_jp: アプリケーションを開発モードで起動すると、Dev Services for PostgreSQL が PostgreSQL の開発モードコンテナーを起動し、アプリケーションの開発を開始することができるようになります。 アプリケーションの開発中に、xref:continuous-testing.adoc[継続的テスト] の機能を使って、テストを個別に追加して実行できます。 Dev Services for PostgreSQL は、開発モードコンテナーと競合しない独立した PostgreSQL テストコンテナーを提供することで、開発中のテストをサポートします。

source: When you use MCF, you don't need dedicated columns to store the hashing algorithm, the iterations count, or the salt because they are all stored in the hashed value.
ja_jp: MCFを使う場合、ハッシュアルゴリズム、反復回数、ソルトはすべてハッシュ値に格納されるため、専用のカラムは必要ありません。

source: When you use SPA to delegate to Quarkus OIDC to manage the authorization code flow, `quarkus.oidc.authentication.java-script-auto-redirect` can be used to work around the fact that many OIDC providers do not support CORS for their authorization endpoints which challenge the user with the authentication screen. By setting`quarkus.oidc.authentication.java-script-auto-redirect=true`, you request Quarkus to return HTTP `499` status, instead of the `302` redirect that would be blocked due to the lack of CORS support for such redirects on the OIDC provider's side, when this redirect is managed by the SPA XHR. The SPA can catch the `499` error and use the `window` API to bypass the browser script restrictions.
ja_jp: SPA を使用して認可コードフローの管理を Quarkus OIDC に委譲する場合、多くの OIDC プロバイダーが、ユーザーに認証画面を提示する認可エンドポイントに対して CORS をサポートしていないという事実を回避するために、`quarkus.oidc.authentication.java-script-auto-redirect` を使用できます。`quarkus.oidc.authentication.java-script-auto-redirect=true`を設定すると、SPA の XHR によってこのリダイレクトが管理される際に、OIDC プロバイダー側でのこのようなリダイレクトに対する CORS サポートの欠如によりブロックされる `302` リダイレクトの代わりに、Quarkus に HTTP `499` ステータスを返すよう要求します。SPA は `499` エラーをキャッチし、`window` API を使用してブラウザースクリプトの制限を回避できます。

source: When you use a browser to anonymously connect to a protected resource, a basic authentication form displays prompting you to enter credentials.
ja_jp: ブラウザーを使って保護されたリソースに匿名で接続すると、認証情報を入力するよう促すBasic認証フォームが表示されます。

source: When you use both mTLS and OIDC bearer authentication mechanisms, you can enforce that the access tokens must be certificate bound with a single property, after configuring your Quarkus endpoint and Quarkus OIDC to require the use of mTLS.
ja_jp: mTLS と OIDC ベアラー認証メカニズムの両方を使用する場合、Quarkus エンドポイントと Quarkus OIDC で mTLS の使用を要求するように設定した後、強制的にアクセストークンが単一のプロパティーで証明書にバインドされるように指定できます。

source: When you use query parameters, be careful that PanacheQL queries will refer to the Object parameters name but native queries will refer to MongoDB field names.
ja_jp: クエリパラメータを使う場合、PanacheQLのクエリはObjectパラメータ名を参照しますが、ネイティブのクエリはMongoDBのフィールド名を参照するので注意が必要です。

source: When you use the `quarkus-smallrye-health` extension, Quarkus can expose health checks for OIDC clients.
ja_jp: `quarkus-smallrye-health` エクステンションを使用する場合、Quarkus は OIDC クライアントのヘルスチェックを公開できます。

source: When you use the infinispan-client extension in dev mode or in test, Quarkus automatically starts an Infinispan server and configure your application.
ja_jp: 開発モードまたはテストでinfinispan-clientエクステンションを使用すると、Quarkusは自動的にInfinispanサーバーを起動し、アプリケーションを設定します。

source: When you use xref:opentelemetry-tracing.adoc[OpenTelemetry], Quarkus flattens tracing data present in the `mdc` field and copies it to `spanId`, `traceSampled`, and `trace`, with the `trace` value including a prefix.
ja_jp: xref:opentelemetry-tracing.adoc[OpenTelemetry] を使用すると、Quarkus は `mdc` フィールドにあるトレースデータをフラット化し、`spanId`、`traceSampled`、`trace` にコピーします。`trace` の値にはプレフィックスが含まれます。

source: When you want to specify a non-default caption for your URL, specify the anchored ID and desired name separated by `,` without white space.
ja_jp: URL にデフォルト以外のキャプションを指定する場合は、アンカー ID と希望の名前を空白なしで `,` で区切って指定します。

source: When you want to use Podman as a drop-in-replacement for Docker, you will have some problems because the Heroku CLI depends on Docker and doesn't support the OCI format. But there are possible solutions for these problems.
ja_jp: Podman を Docker の代替品として使用したい場合、Heroku CLI は Docker に依存しており、OCI 形式をサポートしていないため、いくつかの問題が発生します。ただし、これらの問題には解決策があります。

source: When you work with Keycloak in production, <<dev-services-for-keycloak>> provides the best dev mode experience. For other OpenID Connect providers, it is recommended to enable the Dev Services for OIDC like in the example below:
ja_jp: Keycloak を実稼働環境で使用する場合、<<dev-services-for-keycloak>> 最高の開発モードエクスペリエンスを提供します。 他の OpenID Connect プロバイダーの場合は、次の例のように OIDC の Dev Services を有効にすることを推奨します。

source: When you work with OAuth2 providers which issue binary access tokens but do not support the remote introspection, and do not have standard `UserInfo` support, `quarkus.oidc.user-info-path` must point to the OAuth2 provider specific endpoint returning information about the current user, in order to support an indirect access token verification. See the xref:security-oidc-code-flow-authentication.adoc#oauth2[OAuth2 providers] section for more details.
ja_jp: バイナリアクセストークンを発行するもののリモートイントロスペクションをサポートしておらず、標準的な `UserInfo` もサポートしていない OAuth2 プロバイダーを扱う場合、間接的なアクセストークン検証をサポートするために、 `quarkus.oidc.user-info-path` で現在のユーザーに関する情報を返す OAuth2 プロバイダー固有のエンドポイントを指す必要があります。詳細は xref:security-oidc-code-flow-authentication.adoc#oauth2[OAuth2 プロバイダー] セクションを参照してください。

source: When you work with pure OAuth2 providers such as GitHub, setting `quarkus.oidc.authentication.user-info-required=true` is always required. The reason is that `OAuth2` does not provide `ID token`, but only an `access token`. In the OAuth2-only world alone, the access token is not even meant for the current client, which is the Quarkus endpoint which acquired it, but for this endpoint to access some downstream service on behalf of the current user. But Quarkus needs to have an access to the current user identity, therefore this property must be set in such cases. But since OAuth2 providers do not have a standard OIDC `UserInfo` endpoint, `quarkus.oidc.user-info-path` must be configured to point to the OAuth2 provider specific endpoint returning information about the current user, for example, in case of GitHub, it is `https://api.github.com/user`. See the xref:security-oidc-code-flow-authentication.adoc#oauth2[OAuth2 providers] section for more informatiom.
ja_jp: GitHub のような純粋な OAuth2 プロバイダーを使用する場合、 `quarkus.oidc.authentication.user-info-required=true` の設定は常に必須です。その理由は、 `OAuth2` は `ID トークン` を提供せず、 `アクセストークン` のみを提供するためです。OAuth2 のみの世界では、アクセストークンは、それを取得した Quarkus エンドポイントである現在のクライアント自身のためのものではなく、そのエンドポイントが現在のユーザーに代わってダウンストリームサービスにアクセスするためのものです。しかし、Quarkus は現在のユーザーのアイデンティティーにアクセスする必要があるため、このような場合にはこの設定プロパティーを設定する必要があります。ただし、OAuth2 プロバイダーには標準の OIDC `UserInfo` エンドポイントがないため、現在のユーザーに関する情報を返すプロバイダー固有のエンドポイントを指すように `quarkus.oidc.user-info-path` を設定する必要があります。たとえば GitHub の場合は `https://api.github.com/user` です。詳細は xref:security-oidc-code-flow-authentication.adoc#oauth2[OAuth2 プロバイダー] セクションを参照してください。

source: When you're done playing with "dev-mode" you can run it as a standard Java application.
ja_jp: "dev-mode" で遊び終わったら、標準のJavaアプリケーションとして実行することができます。

source: When you're done playing with dev mode you can run it as a standard Java application.
ja_jp: 「開発モード」で遊び終わったら、標準のJavaアプリケーションとして実行することができます。

source: When you're done playing with dev mode, you can run it as a standard Java application.
ja_jp: 「開発モード」で遊び終わったら、標準のJavaアプリケーションとして実行することができます。

source: When you're done playing with the `dev` mode" you can run it as a standard Java application.
ja_jp: 「`dev` モード」で遊び終わったら、標準のJavaアプリケーションとして実行することができます。

source: When your application is running, you can access its endpoints by using one of the following Curl commands.
ja_jp: アプリケーションの実行中に、以下の Curl コマンドのいずれかを使用してエンドポイントにアクセスできます。

source: When your application is running, you can access your application by using one of the following `curl` commands. You can also access the same endpoint URLs by using a browser.
ja_jp: アプリケーションの実行中は、以下の `curl` コマンドのいずれかを使用して、アプリケーションにアクセスできます。また、ブラウザを使用して同じエンドポイントURLにアクセスすることもできます。

source: When your application serves HTML pages and provides REST API at the same time, and requires both the authorization code flow authentication and xref:security-oidc-bearer-token-authentication.adoc[the bearer access token authentication], the `quarkus.oidc.application-type` property can be set to `hybrid` instead. In this case, the authorization code flow is triggered only when the HTTP `Authorization` request header with the `Bearer` scheme and a bearer access token is not available.
ja_jp: アプリケーションが HTML ページを提供すると同時に REST API を提供し、認可コードフロー認証と xref:security-oidc-bearer-token-authentication.adoc[ベアラーアクセストークン認証] の両方が必要な場合は、代わりに `quarkus.oidc.application-type` プロパティーを `hybrid` に設定できます。 この場合、`Bearer` スキームとベアラーアクセストークンを含む HTTP `Authorization` リクエストヘッダーが利用できない場合にのみ、認可コードフローがトリガーされます。

source: When your custom extension must acquire OIDC tokens by using one of the token grants supported by the OIDC client, the extension can depend only on the OIDC Client SPI and let the OIDC client itself acquire and refresh access tokens as needed.
ja_jp: カスタムエクステンションが OIDC クライアントでサポートされているトークングラントの 1 つを使用して OIDC トークンを取得する必要がある場合、エクステンションは OIDC クライアント SPI のみに依存し、必要に応じて OIDC クライアント自体がアクセストークンを取得および更新できるようにします。

source: When your custom extension must acquire OIDC tokens using one of the OIDC token grants supported by OIDC client, this extension can depend on the OIDC Client SPI only and let OIDC client itself acquire and refresh access tokens as necessary.
ja_jp: カスタムエクステンションが、OIDC クライアントでサポートされている OIDC トークングラントの 1 つを使用して OIDC トークンを取得する必要がある場合、このエクステンションは OIDC クライアント SPI のみに依存し、必要に応じて OIDC クライアント自体がアクセストークンを取得および更新できるようにします。

source: When your repository contains multiple extensions, you need to create a separate file for each individual extension, not just one file for the entire repository.
ja_jp: リポジトリーに複数のエクステンションが含まれている場合は、リポジトリー全体に対して 1 つのファイルを作成するのではなく、個々のエクステンションごとに個別のファイルを作成する必要があります。

source: Whenever your endpoint methods return a object (of when they return a link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse<?>`] or link:{jaxrsapi}/javax/ws/rs/core/Response.html[`Response`] with an entity), RESTEasy Reactive will look for a way to map that into an HTTP response body.
ja_jp: エンドポイントメソッドが（link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse<?>`] もしくはエンティティの link:{jaxrsapi}/javax/ws/rs/core/Response.html[`Response`] を返し）オブジェクトを返すときはいつでも、RESTEasy Reactive は、それを HTTP レスポンス本文にマップする方法を探します。

source: Whenever your endpoint methods return an object (of when they return a link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse<?>`] or link:{jaxrsapi}/jakarta/ws/rs/core/Response.html[`Response`] with an entity), RESTEasy Reactive will look for a way to map that into an HTTP response body.
ja_jp: エンドポイントメソッドが（link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse<?>`] もしくはエンティティの link:{jaxrsapi}/jakarta/ws/rs/core/Response.html[`Response`] を返し）オブジェクトを返すときはいつでも、RESTEasy Reactive は、それを HTTP レスポンス本文にマップする方法を探します。
